nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxa344/demo_apps/mc_pmsm/pmsm_enc/pin_mux.c
/*
 * Copyright 2025 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MCXA344
package_id: MCXA344VLL
mcu_data: ksdk2_0
processor_version: 0.2509.60
pin_labels:
- {pin_num: '57', pin_signal: P3_18/CT2_MAT0/PWM0_X0/PWM1_X0/SMARTDMA_PIO18, label: LED_RED, identifier: LED_RED}
- {pin_num: '56', pin_signal: P3_19/CT2_MAT1/PWM0_X1/PWM1_X1/SMARTDMA_PIO19, label: LED_GREEN, identifier: LED_GREEN}
- {pin_num: '54', pin_signal: P3_21/TRIG_OUT1/LPUART1_TXD/CT2_MAT3/PWM0_X3/PWM1_B3/SMARTDMA_PIO21, label: LED_BLUE, identifier: LED_BLUE}
- {pin_num: '100', pin_signal: P1_7/WUU0_IN9/TRIG_OUT2/LPUART2_CTS_B/CT_INP7/SMARTDMA_PIO3/CAN0_RXD/ADC0_A23, label: SW2, identifier: SW2}
- {pin_num: '73', pin_signal: P3_0/WUU0_IN22/TRIG_IN0/LPUART3_RXD/CT_INP16/PWM0_A0/PWM1_X0/SMARTDMA_PIO0, label: PWM_AT, identifier: PWM_AT}
- {pin_num: '72', pin_signal: P3_1/TRIG_IN1/LPUART3_TXD/CT_INP17/PWM0_B0/PWM1_X1/SMARTDMA_PIO1/FREQME_CLK_OUT0, label: PWM_AB, identifier: PWM_AB}
- {pin_num: '69', pin_signal: P3_8/WUU0_IN23/TRIG_IN3/LPSPI1_SDO/LPUART1_RXD/CT_INP4/PWM0_A1/SMARTDMA_PIO8/CLKOUT, label: PWM_BT, identifier: PWM_BT}
- {pin_num: '68', pin_signal: P3_9/TRIG_IN4/LPSPI1_SDI/LPUART1_TXD/CT_INP5/PWM0_B1/SMARTDMA_PIO9, label: PWM_BB, identifier: PWM_BB}
- {pin_num: '67', pin_signal: P3_10/TRIG_IN5/LPSPI1_SCK/LPUART1_RTS_B/CT1_MAT0/PWM0_A2/SMARTDMA_PIO10, label: PWM_CT, identifier: PWM_CT}
- {pin_num: '66', pin_signal: P3_11/WUU0_IN24/TRIG_IN6/LPSPI1_PCS0/LPUART1_CTS_B/CT1_MAT1/PWM0_B2/SMARTDMA_PIO11, label: PWM_CB, identifier: PWM_CB}
- {pin_num: '29', pin_signal: P2_7/TRIG_IN5/CT_INP19/CT1_MAT3/SMARTDMA_PIO31/VREFI/ADC1_A7/ADC0_A7, label: CUR_A, identifier: CUR_A;CUR_A_ADC0;CUR_A_ADC1}
- {pin_num: '3', pin_signal: P1_10/LPUART1_RTS_B/LPI2C0_SDAS/CT2_MAT0/SMARTDMA_PIO6/CAN0_TXD/ADC1_A8, label: CUR_B, identifier: CUR_B}
- {pin_num: '49', pin_signal: P3_30/TRIG_OUT6/LPI2C1_SCLS/CT0_MAT2/PWM1_A0/SMARTDMA_PIO30/ADC1_A21, label: CUR_C, identifier: CUR_C}
- {pin_num: '97', pin_signal: P1_4/WUU0_IN8/FREQME_CLK_IN0/LPSPI0_PCS3/LPUART2_RXD/CT1_MAT2/SMARTDMA_PIO0/ADC0_A20/CMP0_IN2, label: VOLT_DCB, identifier: VOLT_DCB}
- {pin_num: '10', pin_signal: P1_30/TRIG_OUT3/LPI2C0_SDA/CT_INP16/XTAL48M, label: LED_RED, identifier: LED_RED}
- {pin_num: '11', pin_signal: P1_31/TRIG_IN4/LPI2C0_SCL/CT_INP17/EXTAL48M, label: LED_GREEN, identifier: LED_GREEN}
- {pin_num: '80', pin_signal: P0_6/ISPMODE_N/LPI2C0_HREQ/LPSPI0_PCS1/CT_INP2/SMARTDMA_PIO2/CMP1_OUT/CLKOUT/ADC0_A15, label: SW2, identifier: SW2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitPWM();
    BOARD_InitADC();
    BOARD_InitCMP();
    BOARD_InitENC();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '25', peripheral: LPUART2, signal: RX, pin_signal: P2_3/WUU0_IN19/TRIG_IN7/LPUART0_CTS_B/LPUART2_RXD/CT_INP13/CT2_MAT3/SMARTDMA_PIO27/ADC0_A3/CMP1_IN0/ADC1_A4}
  - {pin_num: '24', peripheral: LPUART2, signal: TX, pin_signal: P2_2/TRIG_IN6/LPUART0_RTS_B/LPUART2_TXD/CT_INP12/CT2_MAT2/SMARTDMA_PIO26/ADC0_A4/CMP0_IN0/CMP1_INN4/CMP2_INN4}
  - {pin_num: '57', peripheral: GPIO3, signal: 'GPIO, 18', pin_signal: P3_18/CT2_MAT0/PWM0_X0/PWM1_X0/SMARTDMA_PIO18, direction: OUTPUT}
  - {pin_num: '56', peripheral: GPIO3, signal: 'GPIO, 19', pin_signal: P3_19/CT2_MAT1/PWM0_X1/PWM1_X1/SMARTDMA_PIO19, direction: OUTPUT}
  - {pin_num: '54', peripheral: GPIO3, signal: 'GPIO, 21', pin_signal: P3_21/TRIG_OUT1/LPUART1_TXD/CT2_MAT3/PWM0_X3/PWM1_B3/SMARTDMA_PIO21, direction: OUTPUT}
  - {pin_num: '100', peripheral: GPIO1, signal: 'GPIO, 7', pin_signal: P1_7/WUU0_IN9/TRIG_OUT2/LPUART2_CTS_B/CT_INP7/SMARTDMA_PIO3/CAN0_RXD/ADC0_A23, direction: INPUT,
    gpio_per_interrupt: kGPIO_InterruptRisingEdge}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
    /* GPIO1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO1);
    /* GPIO3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GateGPIO3);
    /* PORT1: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT1);
    /* PORT2: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT2);
    /* PORT3: Peripheral clock is enabled */
    CLOCK_EnableClock(kCLOCK_GatePORT3);
    /* GPIO1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO1_RST_SHIFT_RSTn);
    /* GPIO3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kGPIO3_RST_SHIFT_RSTn);
    /* PORT1 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT1_RST_SHIFT_RSTn);
    /* LPUART2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kLPUART2_RST_SHIFT_RSTn);
    /* PORT2 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT2_RST_SHIFT_RSTn);
    /* PORT3 peripheral is released from reset */
    RESET_ReleasePeripheralReset(kPORT3_RST_SHIFT_RSTn);

